# Run `brew bundle` to install these

# Brews

# Dotfile Management
brew 'mr'  # fine for now, but end-of-lifed, may want to migrate to: repo, gita, or vcstool
brew 'vcsh'

# Development Tools
brew 'ant'
brew 'asdf'
brew 'bat'
brew 'binutils'
brew 'checkbashisms'
brew 'cflow'
brew 'chisel'
brew 'clang-format'
brew 'cmake'
brew 'cppcheck'
brew 'cpputest'
brew 'exa'
brew 'git'
brew 'git-flow'  # TODO: vs git-flow-avh
brew 'git-lfs'
brew 'gradle'
brew 'hadolint'
brew 'hg'
brew 'hugo'
brew 'ideviceinstaller', args: ['HEAD']
brew 'jadx'
brew 'libimobiledevice', args: ['HEAD']
brew 'libplist'
brew 'libvirt'
brew 'llvm', args: ['with-clang', 'with-clang-extra-tools', 'with-lld', 'with-lldb', 'with-rtti', 'with-all-targets', 'with-python']
# brew 'lua'  # TODO: is this managed by asdf now?
brew 'maven'
brew 'mono'
brew 'nasm'
brew 'neovim'
# brew 'opam'  # TODO: is this managed by asdf now?
brew 'pipx'
brew 'radare2'
brew 'shellcheck'
brew 'socat'
brew 'splint'
brew 'swiftformat'
brew 'swiftlint'
brew 'testssl'
brew 'tig'
brew 'usbmuxd', args: ['HEAD']
brew 'valgrind'
brew 'vim', args: ['override-system-vi', 'with-lua', 'with-luajit']
brew 'whalebrew'
brew 'xcproj'
brew 'xctool'
brew 'yarn', args: ['ignore-dependencies']

# Workflow Tools
brew 'brew-cask-completion'
brew 'cheat'
brew 'diff-so-fancy'
brew 'docker'
brew 'entr'
brew 'fasd'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fzf'
brew 'getmail'
brew 'gh'
brew 'gifsicle'
brew 'grc'
brew 'htop'
brew 'lima'
brew 'mas'
brew 'ncdu'
brew 'neofetch'
brew 'nmap'
brew 'notmuch'
brew 'pandoc'
brew 'podman'
brew 'pstree'
brew 'pv'
brew 'ranger'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'ripgrep'
brew 'ssh-copy-id'
brew 'starship'
brew 'streamlink'
brew 'terminal-notifier'
brew 'thefuck'
brew 'tmux'
brew 'tree'
brew 'urlview'
brew 'weechat'
brew 'wget'

# Writing
brew 'languagetool'
brew 'redpen'
brew 'vale'

# Android
brew 'libusb'  # req for Heimdall
brew 'pyqt5'  # req for Heimdall

# For consideration
# brew 'ghi'
# brew 'mobile-shell'
# brew 'gist'
# sdkman (would need a homebrew recipe)
# brew 'swig'  # Python M2Crypto library needs this
brew 'graphviz'  # Python pygraphviz library needs this

# Used to: $ brew install --with-gpgme --with-sidebar-patch https://gist.githubusercontent.com/Pewpewarrows/b9f545306a00004d8009/raw/7e47a7660491f5dfbae31dc43001cc6eb9aac12b/mutt.rb
# Still need to (on locked down networks): $ brew edit sgeb/mutt/mutt
#   mirror "https://bitbucket.org/mutt/mutt/downloads/mutt-1.5.24.tar.gz"
# TODO: this sidebar patch is old...
tap 'sgeb/mutt'
brew 'sgeb/mutt/mutt', args: ['with-gpgme', 'with-sidebar-patch']

# TODO: dupes is gone, find where gdb is now
# tap 'homebrew/dupes'
# brew 'gdb'

tap 'thoughtbot/formulae'
brew 'liftoff'

tap 'tgray/homebrew-tgbrew'
brew 'contacts2'
brew 'muttqt'

tap 'universal-ctags/homebrew-universal-ctags'
brew 'universal-ctags', args: ['HEAD']

tap 'turforlag/homebrew-cervezas'
brew 'pdftk'

tap 'hudochenkov/sshpass'
brew 'sshpass'

tap 'linux-noah/noah'
brew 'noah'

tap 'facebook/fb'
brew 'idb-companion'

# tap 'jeffreywildman/homebrew-virt-manager'
# brew 'virt-manager'
# brew 'virt-viewer'

# This extends brew with a "cu" subcommand, only need to tap, no further
# installs
# TODO: is this still necessary?
# tap 'buo/cask-upgrade'

# Casks
cask '1password'
cask '1password-cli'
cask 'adium'
cask 'adobe-acrobat-reader'
cask 'alt-tab'
cask 'anki'
cask 'appcleaner'
cask 'audacity'
cask 'balenaetcher'
cask 'bartender'
cask 'beardedspice'
cask 'blender'
cask 'caffeine'
cask 'cheatsheet'
cask 'darktable'
cask 'discord'
cask 'dropbox'
cask 'firefox'
# cask 'flash'  # was renamed to flash-npapi, may not want anymore anyway
cask 'focus'
cask 'godot'
cask 'google-drive'
# cask 'gpgtools'
cask 'gpg-suite'
cask 'handbrake'
cask 'iglance'
cask 'inkscape'
cask 'keybase'
cask 'krita'
cask 'licecap'
cask 'loading'
cask 'logitech-options'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'mixxx'
cask 'natron'
cask 'obs'
# cask 'onedrive'  # not necessary if installing microsoft-office
cask 'rectangle'
cask 'resilio-sync'
# cask 'sensiblesidebuttons'  # TODO: maybe remove if logitech-options enough
cask 'shotcut'
cask 'signal'
cask 'sketchbook'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'stay'
cask 'streamlink-twitch-gui'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'thingsmacsandboxhelper'
cask 'torbrowser'
cask 'transmission'
# cask 'tunnelblick'  # TODO: maybe remove for wireguard
cask 'tweetbot'
cask 'vlc'
cask 'vnc-viewer'
cask 'whatsapp'
cask 'zoom'

# Development
cask 'adoptopenjdk'
cask 'android-studio'
cask 'balsamiq-mockups'
cask 'cutter'
cask 'dash'
cask 'gas-mask'
cask 'ghidra'
cask 'github'
# cask 'haskell-platform'  # TODO: look into asdf versioning
# cask 'heimdall-suite'  # does not build without PR 468, installed manually
cask 'hex-fiend'
cask 'hopper-disassembler'
cask 'java'
cask 'kitty'
cask 'mactex'
cask 'oclint'
cask 'osxfuse'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vmware-fusion'

tap 'railwaycat/homebrew-emacsmacport'
cask 'emacs-mac'

tap 'caskroom/fonts'
# Alternatives instead of macOS built-ins Monaco and SF Mono
cask 'font-fira-mono'
# TODO: manually downloaded
# https://github.com/ryanoasis/nerd-fonts/blob/master/src/glyphs/Symbols-2048-em%20Nerd%20Font%20Complete.ttf
# copied to ~/Library/Fonts/ and ran
# $ fc-cache -fr
# will want to make a formula based on:
# https://github.com/Homebrew/homebrew-cask-fonts/blob/master/Casks/font-powerline-symbols.rb
# cask 'font-firacode-nerd-font'
cask 'font-firamono-nerd-font'
# cask 'font-hack-nerd-font'
# cask 'font-sourcecodepro-nerd-font'
# Unavailable
# - office code pro
# - proggy vector

# For consideration
# TODO: Postgres.app has an internal check that its real directory is
#       /Applications/Postgres.app/, so even an --appdir=/Applications symlink
#       won't work for it. Would like to eventually fix this.
# cask 'postgres'
# cask 'alfred'
# cask 'textexpander'
# cask 'sequel-pro'
# TODO: Google Chrome from cask doesn't play nice with the 1Password extension?
# cask 'google-chrome'
# cask 'cloudapp'
# TODO: The cask forumla was removed after the download link was removed from
#       the app's homepage. What's the status of Induction.app?
#       https://github.com/caskroom/homebrew-cask/pull/8772
# cask 'induction'
# cask 'kitematic'
# TODO: if still using safari extensions requiring simbl, install this
# cask 'easysimbl'
# cask 'mojibar'
# cask 'fantastical'
# cask 'imageoptim'
# cask 'coyim'
# cask 'intel-haxm'

# For consideration, Quick Look Plugins
# cask 'qlcolorcode'
# cask 'qlstephen'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'qlprettypatch'
# cask 'quicklook-csv'
# cask 'betterzipql'
# cask 'webpquicklook'
# cask 'suspicious-package'
# after installing these: $ qlmanage -r

# Mac App Store

mas 'AdGuard for Safari', id: 1440147259
mas 'Dropover', id: 1355679052
mas 'DuckDuckGo Privacy Essentials', id: 1482920575
mas 'GarageBand', id: 682658836
mas 'Honey', id: 1472777122
mas 'Hush', id: 1544743900
mas 'Keynote', id: 409183694
mas 'OneTab', id: 1540160809
mas 'Pages', id: 409201541
mas 'PiPer', id: 1421915518
mas 'Pomodoro Timer', id: 872515009
mas 'Reddirect', id: 1479320952
mas 'Things', id: 904280696
mas 'Twitter', id: 1482454543
mas 'VMware Remote Console', id: 1230249825
mas 'Vimari', id: 1480933944
mas 'Wayback Machine', id: 1472432422
mas 'Wipr', id: 1320666476
mas 'WireGuard', id: 1451685025
mas 'Xcode', id: 497799835
mas 'm-wiki', id: 1480168619

# Whalebrews
