franciscolourenco/done
jethrokuan/fzf
oh-my-fish/plugin-fasd
markcial/upto
oh-my-fish/plugin-grc
jorgebucaran/fish-spark
laughedelic/pisces
danhper/fish-ssh-agent
